app/controllers/school_classes_controller.rb

	def update
		@school_class = current_school_class
		@school_class.update(school_class_params)
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2017-07-25 21:24:30.238436"], ["id", 1]]