app/controllers/students_controller.rb

	def update
		@student = current_student
		@student.update(student_params)
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2017-07-25 21:06:02.568362"], ["id", 1]]